---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTypeChangedToGeneric
source: html/fe2c9318-1c4a-0151-b106-acecc7832979.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTypeChangedToGeneric Property

Structural Connection had an inappropriate type, which has been changed to 'Generic Connection'.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralConnectionTypeChangedToGeneric { get; }
```